x1,x2,x3,x4,x5,x6,x7 = 487.65182495,  338.28735352,  330.76286316,  940.85216522,1010.73265076,  678.72524261, 1712.98980713


CV1 = (0.134*x1+0.145*x2+0.148*x3+0.152*x4+0.133*x6+0.142*x7) / (x1+x2+x3+x4+x5+x6+x7)
# 约束2
CV2 = (x1+x2+x3+x4+x5+x6+x7)
# 约束3
CV3 = (x1+x3+x5)/(x1+x2+x3+x4+x5+x6+x7)
# 约束4
CV4 = (x2+x4)/(x1+x2+x3+x4+x5+x6+x7)

print(f"x1:{x1}")
print(f"x2:{x2}")
print(f"x3:{x3}")
print(f"x4:{x4}")
print(f"x5:{x5}")
print(f"x6:{x6}")
print(f"x7:{x7}")

print('约束条件',[CV1, CV2, CV3, CV4])
print("满足全部约束")